## EDA을 위한 다양한 pandas function 연습  
---
참고링크 : https://pandas.pydata.org/docs/user_guide/10min.html  
한글 : https://dandyrilla.github.io/2017-08-12/pandas-10min/

API ref : https://pandas.pydata.org/docs/reference/index.html

In [71]:
import numpy as np
import pandas as pd

### series and dataFrame 

차이점을 기억해 두자  
series 1차 배열  
dataFrame 2차 배열  

실제 data 특성에 맞는 샘플 데이터를 만들수 있어야 한다.   
해당 샘플 데이터로 각 연산 결과를 미리 확인 할 수 있어야 한다.   
print(type()) 을 이용하여 object 의 타입을 정확히 파악해야 한다.  
( series[index_label] vs dataframe[column_label] )  
answer.ipynb 와 test.ipynb, sample.ipynb 으로 운영한다. 

```
pd.DataFrame( Serise, 
              columns = ['',''])
              index = lsit
            )

pd.DataFrame(
    { 
      'A': list
      'B': ['', '']
    },
    index=['','']
    )
```

In [72]:
pd.DataFrame({ 
    'B': ['B', 'C'],
}, index= [1,2])

   B
1  B
2  C

In [73]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [74]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [75]:
# df 만드든 방법 1

df = pd.DataFrame(np.random.randn(6, 4),
                   index=dates, 
                   columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.530079  0.676670  0.216498  0.304434
2013-01-02 -0.966575  0.073820  1.850707 -0.067192
2013-01-03 -0.419120 -1.919785 -0.834839  0.497296
2013-01-04 -1.599862  2.503262  0.729267  0.909971
2013-01-05 -1.051489  0.857625  0.791734 -0.864913
2013-01-06 -0.064495 -0.494565  1.023769  1.125469

In [76]:
S = df.A
S[1:]   # silicing

S[1]  # serise indexiting
S[S>1] # serise masking

Series([], Freq: D, Name: A, dtype: float64)

In [77]:

D = df[['A','B']]

D[1:]   # df slicing
# D[1]    # indexing 은 오류
D[D>1]

             A         B
2013-01-01 NaN       NaN
2013-01-02 NaN       NaN
2013-01-03 NaN       NaN
2013-01-04 NaN  2.503262
2013-01-05 NaN       NaN
2013-01-06 NaN       NaN

dataFrame :   
DataFrame은 2차원 배열 데이터라고 이해하는 것보다 공통 인덱스를 가진 column series를 딕셔너리로 묶어놓은 것

In [78]:
# df 만드는 방법 2 

df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

df2 
# df2[:]
# df2[:][:]
# df2.loc[:,:]

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

### 2. Viewing Data

In [79]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [80]:
print(df.head(2),'\n')

print(df.tail(2), '\n')

print(df.index, '\n')

print(df.columns, '\n')

df.describe()

                   A        B         C         D
2013-01-01  0.530079  0.67667  0.216498  0.304434
2013-01-02 -0.966575  0.07382  1.850707 -0.067192

                   A         B         C         D
2013-01-05 -1.051489  0.857625  0.791734 -0.864913
2013-01-06 -0.064495 -0.494565  1.023769  1.125469

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

Index(['A', 'B', 'C', 'D'], dtype='object')

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.595244  0.282838  0.629523  0.317511
std    0.766077  1.477522  0.894195  0.718668
min   -1.599862 -1.919785 -0.834839 -0.864913
25%   -1.030261 -0.352469  0.344691  0.025715
50%   -0.692848  0.375245  0.760500  0.400865
75%   -0.153151  0.812386  0.965760  0.806802
max    0.530079  2.503262  1.850707  1.125469

In [81]:
# 행, 열을 바꾼다. 

df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.530079   -0.966575   -0.419120   -1.599862   -1.051489   -0.064495
B    0.676670    0.073820   -1.919785    2.503262    0.857625   -0.494565
C    0.216498    1.850707   -0.834839    0.729267    0.791734    1.023769
D    0.304434   -0.067192    0.497296    0.909971   -0.864913    1.125469

In [82]:
df.to_numpy()

array([[ 0.53007871,  0.67667023,  0.2164985 ,  0.30443393],
       [-0.96657542,  0.07381999,  1.85070726, -0.06719181],
       [-0.41912008, -1.91978477, -0.8348391 ,  0.49729568],
       [-1.59986154,  2.5032618 ,  0.72926668,  0.90997053],
       [-1.0514895 ,  0.85762502,  0.79173367, -0.86491254],
       [-0.06449503, -0.49456549,  1.02376897,  1.12546883]])

In [83]:
df.select_dtypes(include='int64')

Empty DataFrame
Columns: []
Index: [2013-01-01 00:00:00, 2013-01-02 00:00:00, 2013-01-03 00:00:00, 2013-01-04 00:00:00, 2013-01-05 00:00:00, 2013-01-06 00:00:00]

In [84]:
df.select_dtypes(include='number')

                   A         B         C         D
2013-01-01  0.530079  0.676670  0.216498  0.304434
2013-01-02 -0.966575  0.073820  1.850707 -0.067192
2013-01-03 -0.419120 -1.919785 -0.834839  0.497296
2013-01-04 -1.599862  2.503262  0.729267  0.909971
2013-01-05 -1.051489  0.857625  0.791734 -0.864913
2013-01-06 -0.064495 -0.494565  1.023769  1.125469

value_counts()

df.value_counts()   : 1 이상이면 동일한 row 존재  (전부 1이면, 다 값이 다르고, 실재 row 갯수 만큼 나온다.)  
series.value_counts() : 1 이상이면 동일한 값 존재

### 3. Selection 

df[1] : 인텍싱  '정수일때만 가능 (df[df.index == 1] 가 같음), 주로 df 'column' 선택에 사용  
df[2:4] : 슬라이싱  
df[df>1] : 마스킹  

=> 주로 Serise 을 사용할때 사용한다고 생각하자. series[1] / series[2:4] / serise[serise>1]

.             : ```df.col```  
[]            : ```df[column]```         , * df[row_lable: ] 은 사용하지 말자.  
loc (or at)   : df.loc[index_lable,] 은 조건일때만 사용     , ```df.loc[ : , col_label]```    
iloc (or iat) : ```df.iloc[몇번째 row]``` , df.iloc[ : , 몇번째 col]

In [85]:
print(df['A'],'\n')
print(df[:]['A'],'\n')              #df.loc[:,'A']
# df['2013-01-01':]['A']            # chained indexing ?
# df.A

## column 을 선택하게 되며 series 로 리턴된다.


print(df[['A']],'\n')               # df 으로 리턴 
df[['A','C']]                       # dataFrame 리턴

## 2개 이상, 이거나 [[ 'col' ]] 으로 1개 col 을 df 로 리턴

2013-01-01    0.530079
2013-01-02   -0.966575
2013-01-03   -0.419120
2013-01-04   -1.599862
2013-01-05   -1.051489
2013-01-06   -0.064495
Freq: D, Name: A, dtype: float64

2013-01-01    0.530079
2013-01-02   -0.966575
2013-01-03   -0.419120
2013-01-04   -1.599862
2013-01-05   -1.051489
2013-01-06   -0.064495
Freq: D, Name: A, dtype: float64

                   A
2013-01-01  0.530079
2013-01-02 -0.966575
2013-01-03 -0.419120
2013-01-04 -1.599862
2013-01-05 -1.051489
2013-01-06 -0.064495

                   A         C
2013-01-01  0.530079  0.216498
2013-01-02 -0.966575  1.850707
2013-01-03 -0.419120 -0.834839
2013-01-04 -1.599862  0.729267
2013-01-05 -1.051489  0.791734
2013-01-06 -0.064495  1.023769

In [86]:
# 오류 

# print(df[0],'\n')                # 명시적 인덱스 0 을 찾기때문에 오류
# print(df['2013-01-01'],'\n')     # column 에서 찾기 때문에 오류 
print(df['2013-01-01':'2013-01-02'],'\n')  # 근데 이건 됨... 헐.
print(df[:'2013-01-02'],'\n')

                   A        B         C         D
2013-01-01  0.530079  0.67667  0.216498  0.304434
2013-01-02 -0.966575  0.07382  1.850707 -0.067192

                   A        B         C         D
2013-01-01  0.530079  0.67667  0.216498  0.304434
2013-01-02 -0.966575  0.07382  1.850707 -0.067192

In [87]:
# df[0:3]
# df['2013-01-01':'2013-01-03']
print(df['2013-01-04':], '\n')
print(df['2013-01-04':'2013-01-04'], '\n')     # 3, 4 열, label 은 끝 포함
print(df[3:4], '\n')                           # 3열만, index 은 -1 까지
df[3:]

# row 을 선택하게 되며, dataFrame 으로 리턴된다

                   A         B         C         D
2013-01-04 -1.599862  2.503262  0.729267  0.909971
2013-01-05 -1.051489  0.857625  0.791734 -0.864913
2013-01-06 -0.064495 -0.494565  1.023769  1.125469

                   A         B         C         D
2013-01-04 -1.599862  2.503262  0.729267  0.909971

                   A         B         C         D
2013-01-04 -1.599862  2.503262  0.729267  0.909971

                   A         B         C         D
2013-01-04 -1.599862  2.503262  0.729267  0.909971
2013-01-05 -1.051489  0.857625  0.791734 -0.864913
2013-01-06 -0.064495 -0.494565  1.023769  1.125469

In [88]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [89]:
print(df2[:3])  # 이런 형태는 사용하지 말자.  3번째 까지, column 이랑 혼동된다.
# df2.iloc[,:3] 3번째 columns 까지 인건지, df2.iloc[:3,] 3번째 row 인건지??

print(df2.loc[:3,])  # 이것도 사용하지 말자.  3번 까지 , 3번이 어디있을줄 알고... 
# 정수형이 아니면 df.loc[:'서울',] 이건 괜찬을듯.

df2.iloc[:3,]   # 이걸 사용하자. 3번째 까지

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo

In [90]:
#chained indexing?
print(df2[2:4]['A'],'\n')     # row / col
print(df2[2:4][0:4], '\n')     # row seriese 의 row serise
df2[2:4][0:1]                 # 2,3 row 로 만들어진 것에서 다시 0,1 row 첫번째

2    1.0
3    1.0
Name: A, dtype: float64

     A          B    C  D      E    F
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

     A          B    C  D     E    F
2  1.0 2013-01-02  1.0  3  test  foo

In [91]:
df2.iloc[0]     # 암묵적 인덱스 0 번째 선택

A                    1.0
B    2013-01-02 00:00:00
C                    1.0
D                      3
E                   test
F                    foo
Name: 0, dtype: object

In [92]:
df2.loc[2]        # 명시적 인덱스 2 선택

A                    1.0
B    2013-01-02 00:00:00
C                    1.0
D                      3
E                   test
F                    foo
Name: 2, dtype: object

Row

df.shape[0] = row 행갯수

df.iloc[몇번째 row,]  
df.loc[row_label,]  ```---> row_label 대신 조건절이 들어가면 조건절은 해당 row 의 index label 을 리턴한다.```

으로만 사용

In [93]:
df2.shape, df2.shape[0], df2.shape[1]

((4, 6), 4, 6)

In [94]:
# row label (명시적, 몇번) 을 이용해서 row 을 인덱싱
# index 가 int 인 경우 df.loc[index_int] 도 가능, 
print(df.loc['20130101'],'\n')              # series
print(df.loc['20130101':'20130102'],'\n')   # dataFrame
print(df.loc[['20130101','20130102']],'\n')

# row location (암묵적 , 몇번째) index 을 이용해서 row 인덱싱
print(df.iloc[0],'\n')                      # series
print(df.iloc[0:1],'\n')                    #dataFrame
print(df.iloc[[0,1]],'\n')

A    0.530079
B    0.676670
C    0.216498
D    0.304434
Name: 2013-01-01 00:00:00, dtype: float64

                   A        B         C         D
2013-01-01  0.530079  0.67667  0.216498  0.304434
2013-01-02 -0.966575  0.07382  1.850707 -0.067192

                   A        B         C         D
2013-01-01  0.530079  0.67667  0.216498  0.304434
2013-01-02 -0.966575  0.07382  1.850707 -0.067192

A    0.530079
B    0.676670
C    0.216498
D    0.304434
Name: 2013-01-01 00:00:00, dtype: float64

                   A        B         C         D
2013-01-01  0.530079  0.67667  0.216498  0.304434

                   A        B         C         D
2013-01-01  0.530079  0.67667  0.216498  0.304434
2013-01-02 -0.966575  0.07382  1.850707 -0.067192

Column

df.shape[1] = columns 열갯수

특정 column 은 몇번째 column 인가? 는 어떻게 찾지?

In [95]:

# column lable 을 이용해서 column 인덱싱
# print(df.loc['A'],'\n')      # 'A' 을 row 인텍싱으로 생각해서 
print(df.loc[:,'A'],'\n')
print(df.loc[:, ['A']],'\n')
print(df.loc[:,'A':'B'],'\n')
print(df.loc[:,['A','B']],'\n')

2013-01-01    0.530079
2013-01-02   -0.966575
2013-01-03   -0.419120
2013-01-04   -1.599862
2013-01-05   -1.051489
2013-01-06   -0.064495
Freq: D, Name: A, dtype: float64

                   A
2013-01-01  0.530079
2013-01-02 -0.966575
2013-01-03 -0.419120
2013-01-04 -1.599862
2013-01-05 -1.051489
2013-01-06 -0.064495

                   A         B
2013-01-01  0.530079  0.676670
2013-01-02 -0.966575  0.073820
2013-01-03 -0.419120 -1.919785
2013-01-04 -1.599862  2.503262
2013-01-05 -1.051489  0.857625
2013-01-06 -0.064495 -0.494565

                   A         B
2013-01-01  0.530079  0.676670
2013-01-02 -0.966575  0.073820
2013-01-03 -0.419120 -1.919785
2013-01-04 -1.599862  2.503262
2013-01-05 -1.051489  0.857625
2013-01-06 -0.064495 -0.494565

In [96]:
df.head()

                   A         B         C         D
2013-01-01  0.530079  0.676670  0.216498  0.304434
2013-01-02 -0.966575  0.073820  1.850707 -0.067192
2013-01-03 -0.419120 -1.919785 -0.834839  0.497296
2013-01-04 -1.599862  2.503262  0.729267  0.909971
2013-01-05 -1.051489  0.857625  0.791734 -0.864913

In [97]:

# column locatin (몇번째) index 을 이용해서 column 인덱싱
print(df.iloc[0],'\n')          # 0 을 row 인텍싱으로 생각해서 0번째 location row 을 인텍싱
print(df.iloc[:,0],'\n')        # 0 번째 column series 리턴
print(df.iloc[:,[0]])           # 0 번째 column df 리턴

A    0.530079
B    0.676670
C    0.216498
D    0.304434
Name: 2013-01-01 00:00:00, dtype: float64

2013-01-01    0.530079
2013-01-02   -0.966575
2013-01-03   -0.419120
2013-01-04   -1.599862
2013-01-05   -1.051489
2013-01-06   -0.064495
Freq: D, Name: A, dtype: float64

                   A
2013-01-01  0.530079
2013-01-02 -0.966575
2013-01-03 -0.419120
2013-01-04 -1.599862
2013-01-05 -1.051489
2013-01-06 -0.064495

In [98]:
print(df.iloc[:,0:2],'\n')

                   A         B
2013-01-01  0.530079  0.676670
2013-01-02 -0.966575  0.073820
2013-01-03 -0.419120 -1.919785
2013-01-04 -1.599862  2.503262
2013-01-05 -1.051489  0.857625
2013-01-06 -0.064495 -0.494565

In [99]:
print(df.iloc[:,[0,1,3]],'\n')

                   A         B         D
2013-01-01  0.530079  0.676670  0.304434
2013-01-02 -0.966575  0.073820 -0.067192
2013-01-03 -0.419120 -1.919785  0.497296
2013-01-04 -1.599862  2.503262  0.909971
2013-01-05 -1.051489  0.857625 -0.864913
2013-01-06 -0.064495 -0.494565  1.125469

In [100]:
df.rename({'A':'a'},axis=1)

                   a         B         C         D
2013-01-01  0.530079  0.676670  0.216498  0.304434
2013-01-02 -0.966575  0.073820  1.850707 -0.067192
2013-01-03 -0.419120 -1.919785 -0.834839  0.497296
2013-01-04 -1.599862  2.503262  0.729267  0.909971
2013-01-05 -1.051489  0.857625  0.791734 -0.864913
2013-01-06 -0.064495 -0.494565  1.023769  1.125469

In [101]:
df.add_suffix('_S')

                 A_S       B_S       C_S       D_S
2013-01-01  0.530079  0.676670  0.216498  0.304434
2013-01-02 -0.966575  0.073820  1.850707 -0.067192
2013-01-03 -0.419120 -1.919785 -0.834839  0.497296
2013-01-04 -1.599862  2.503262  0.729267  0.909971
2013-01-05 -1.051489  0.857625  0.791734 -0.864913
2013-01-06 -0.064495 -0.494565  1.023769  1.125469

In [102]:
df.loc[::-1]   # row 순서 역순

                   A         B         C         D
2013-01-06 -0.064495 -0.494565  1.023769  1.125469
2013-01-05 -1.051489  0.857625  0.791734 -0.864913
2013-01-04 -1.599862  2.503262  0.729267  0.909971
2013-01-03 -0.419120 -1.919785 -0.834839  0.497296
2013-01-02 -0.966575  0.073820  1.850707 -0.067192
2013-01-01  0.530079  0.676670  0.216498  0.304434

In [103]:
df.loc[:,::-1]  # column 역순

                   D         C         B         A
2013-01-01  0.304434  0.216498  0.676670  0.530079
2013-01-02 -0.067192  1.850707  0.073820 -0.966575
2013-01-03  0.497296 -0.834839 -1.919785 -0.419120
2013-01-04  0.909971  0.729267  2.503262 -1.599862
2013-01-05 -0.864913  0.791734  0.857625 -1.051489
2013-01-06  1.125469  1.023769 -0.494565 -0.064495

Multi-indxing

In [104]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [105]:
df2.loc[0:2,'A']

0    1.0
1    1.0
2    1.0
Name: A, dtype: float64

In [106]:
print(df2.loc[[0,1],['A','B']])    # 숫자가 lable 이다 df[[0,1]] 은 오류
print(df2.iloc[[0,1],[0,1]])

     A          B
0  1.0 2013-01-02
1  1.0 2013-01-02
     A          B
0  1.0 2013-01-02
1  1.0 2013-01-02

In [107]:
df

                   A         B         C         D
2013-01-01  0.530079  0.676670  0.216498  0.304434
2013-01-02 -0.966575  0.073820  1.850707 -0.067192
2013-01-03 -0.419120 -1.919785 -0.834839  0.497296
2013-01-04 -1.599862  2.503262  0.729267  0.909971
2013-01-05 -1.051489  0.857625  0.791734 -0.864913
2013-01-06 -0.064495 -0.494565  1.023769  1.125469

In [108]:
df[2:6][df[2:6].A < 0][1:2]

# df 의 2부터 6 row 중 A column  값이 0 보다 작은 두번재 row

                   A         B         C         D
2013-01-04 -1.599862  2.503262  0.729267  0.909971

In [109]:
print(df[2:6])
print(df[2:6].A<0)

# 2개의 index가 같아야 한다. 
# IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

                   A         B         C         D
2013-01-03 -0.419120 -1.919785 -0.834839  0.497296
2013-01-04 -1.599862  2.503262  0.729267  0.909971
2013-01-05 -1.051489  0.857625  0.791734 -0.864913
2013-01-06 -0.064495 -0.494565  1.023769  1.125469
2013-01-03    True
2013-01-04    True
2013-01-05    True
2013-01-06    True
Freq: D, Name: A, dtype: bool

Boolean indexing

```(df[])[(df[]) 조건][column]```  
```(df[]).loc[ (df[]) 조건 , column ]```

iloc 는 boolean index 을 사용할 수 없다.  
iLocation based boolean indexing on an integer type is not available

In [110]:
df[df['A']>0]['B']

2013-01-01    0.67667
Freq: D, Name: B, dtype: float64

In [111]:
df.loc[df['A']>0,'B']

2013-01-01    0.67667
Freq: D, Name: B, dtype: float64

In [112]:
print(df[1:3].A > 0)  # 이거 대신
df.iloc[1:3].A > 0   # 이걸 사용하자

2013-01-02    False
2013-01-03    False
Freq: D, Name: A, dtype: bool

2013-01-02    False
2013-01-03    False
Freq: D, Name: A, dtype: bool

In [113]:
df.iloc[1:3][df.iloc[1:3].A >0]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [114]:
df[1:3][df[1:3].A > 0]   # chained indexing ???

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [115]:
# df[df[1:3].A > 0]  은 오류가 난다.  df 의 index 와 df[1:3] 의 index 가 서로 맞지않다.
# 조건에 대한 true 값의 index label '2013-01-02' 을 리턴한다.
# 따라서 df['2013-01-02'] 가 오류

df[1:3].A > 0

2013-01-02    False
2013-01-03    False
Freq: D, Name: A, dtype: bool

In [116]:
# Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

# df.loc[df[1:3].A > 0] 
df[1:3].loc[df[1:3].A >0]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [117]:
df[1:3][df[0:4].A  > 0]['B']

/var/folders/yn/xbyfmttd1tdc740qcs27ft9m0000gn/T/ipykernel_20423/1907405889.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[1:3][df[0:4].A  > 0]['B']

Series([], Freq: D, Name: B, dtype: float64)

In [118]:
#  UserWarning: Boolean Series key will be reindexed to match DataFrame index. 해결방법 

X = df[1:3]
X[X[0:4].A > 0]['B']

Series([], Freq: D, Name: B, dtype: float64)

In [119]:
df[1:3][df[1:3].A > 0]['B']
# df1 = df[1:3]
# df1.A > 0
# df1['B']

Series([], Freq: D, Name: B, dtype: float64)

funtion indexing

```
pipe()  : Tablewise Function Application
apply() : Row or Column-wise Function Application (df 적용, 행/열 전달 )
agg() and transform() : Aggregation API
map() : Series 에서 값에 적용한다. (Series 적용, 값 전달)
applymap() : Applying Elementwise Functions  (df 적용, 값을 전달)

pd.cut()    : 조건에 따른 구간별 label
np.where()  : 조건에 따른 값표시 (아닌값은 NaN)
```

In [120]:
df

                   A         B         C         D
2013-01-01  0.530079  0.676670  0.216498  0.304434
2013-01-02 -0.966575  0.073820  1.850707 -0.067192
2013-01-03 -0.419120 -1.919785 -0.834839  0.497296
2013-01-04 -1.599862  2.503262  0.729267  0.909971
2013-01-05 -1.051489  0.857625  0.791734 -0.864913
2013-01-06 -0.064495 -0.494565  1.023769  1.125469

In [121]:
df3 = df.copy()
df3['sum_row'] = df3.apply(np.sum,axis=1)    # df3.sum(axis=1) 과 같다.
df3

                   A         B         C         D   sum_row
2013-01-01  0.530079  0.676670  0.216498  0.304434  1.727681
2013-01-02 -0.966575  0.073820  1.850707 -0.067192  0.890760
2013-01-03 -0.419120 -1.919785 -0.834839  0.497296 -2.676448
2013-01-04 -1.599862  2.503262  0.729267  0.909971  2.542637
2013-01-05 -1.051489  0.857625  0.791734 -0.864913 -0.267043
2013-01-06 -0.064495 -0.494565  1.023769  1.125469  1.590177

In [122]:
df3["result"] = df3.apply(lambda r: "Over" if r.sum_row > 0 else "Under", axis=1)
df3

                   A         B         C         D   sum_row result
2013-01-01  0.530079  0.676670  0.216498  0.304434  1.727681   Over
2013-01-02 -0.966575  0.073820  1.850707 -0.067192  0.890760   Over
2013-01-03 -0.419120 -1.919785 -0.834839  0.497296 -2.676448  Under
2013-01-04 -1.599862  2.503262  0.729267  0.909971  2.542637   Over
2013-01-05 -1.051489  0.857625  0.791734 -0.864913 -0.267043  Under
2013-01-06 -0.064495 -0.494565  1.023769  1.125469  1.590177   Over

In [123]:
# bins=[-100,0,100]
# labels =['under','over']      # bins 보다 하나 적은 갯수 (사이값) 이어야 한다.
pd.cut(df3.sum_row, bins=[-100,0,100], labels=['under','over'] )

2013-01-01     over
2013-01-02     over
2013-01-03    under
2013-01-04     over
2013-01-05    under
2013-01-06     over
Freq: D, Name: sum_row, dtype: category
Categories (2, object): ['under' < 'over']

In [124]:
df3 = df3.drop(columns='result')
df3

                   A         B         C         D   sum_row
2013-01-01  0.530079  0.676670  0.216498  0.304434  1.727681
2013-01-02 -0.966575  0.073820  1.850707 -0.067192  0.890760
2013-01-03 -0.419120 -1.919785 -0.834839  0.497296 -2.676448
2013-01-04 -1.599862  2.503262  0.729267  0.909971  2.542637
2013-01-05 -1.051489  0.857625  0.791734 -0.864913 -0.267043
2013-01-06 -0.064495 -0.494565  1.023769  1.125469  1.590177

In [125]:
df3.where((df3.sum_row>0) & (df3.B>0))    # boolean 으로 리턴하지 않고, 값을 리턴 하다. dropna() 을 붙일수 있다.

                   A         B         C         D   sum_row
2013-01-01  0.530079  0.676670  0.216498  0.304434  1.727681
2013-01-02 -0.966575  0.073820  1.850707 -0.067192  0.890760
2013-01-03       NaN       NaN       NaN       NaN       NaN
2013-01-04 -1.599862  2.503262  0.729267  0.909971  2.542637
2013-01-05       NaN       NaN       NaN       NaN       NaN
2013-01-06       NaN       NaN       NaN       NaN       NaN

In [126]:
df3[(df3.sum_row>0) & (df3.B>0)]

# dropna() 까지 한 결과

                   A         B         C         D   sum_row
2013-01-01  0.530079  0.676670  0.216498  0.304434  1.727681
2013-01-02 -0.966575  0.073820  1.850707 -0.067192  0.890760
2013-01-04 -1.599862  2.503262  0.729267  0.909971  2.542637

### 4. Missing 

``` 
dropna()
fillna()
notnull()
notna()   
isnull()
isna() 
```

In [127]:
df3.where((df3.sum_row>0) & (df3.B>0)).fillna(0)

                   A         B         C         D   sum_row
2013-01-01  0.530079  0.676670  0.216498  0.304434  1.727681
2013-01-02 -0.966575  0.073820  1.850707 -0.067192  0.890760
2013-01-03  0.000000  0.000000  0.000000  0.000000  0.000000
2013-01-04 -1.599862  2.503262  0.729267  0.909971  2.542637
2013-01-05  0.000000  0.000000  0.000000  0.000000  0.000000
2013-01-06  0.000000  0.000000  0.000000  0.000000  0.000000

### 5. Operations

```
sum, mean, std, var
sort, count
apply
str
```

In [128]:
print(df.sort_index())
print(df.sort_values('A'),'\n')
# df.sort_values(by='A')
print(df.sort_values(by= ['A','B'],ascending=False))

                   A         B         C         D
2013-01-01  0.530079  0.676670  0.216498  0.304434
2013-01-02 -0.966575  0.073820  1.850707 -0.067192
2013-01-03 -0.419120 -1.919785 -0.834839  0.497296
2013-01-04 -1.599862  2.503262  0.729267  0.909971
2013-01-05 -1.051489  0.857625  0.791734 -0.864913
2013-01-06 -0.064495 -0.494565  1.023769  1.125469
                   A         B         C         D
2013-01-04 -1.599862  2.503262  0.729267  0.909971
2013-01-05 -1.051489  0.857625  0.791734 -0.864913
2013-01-02 -0.966575  0.073820  1.850707 -0.067192
2013-01-03 -0.419120 -1.919785 -0.834839  0.497296
2013-01-06 -0.064495 -0.494565  1.023769  1.125469
2013-01-01  0.530079  0.676670  0.216498  0.304434

                   A         B         C         D
2013-01-01  0.530079  0.676670  0.216498  0.304434
2013-01-06 -0.064495 -0.494565  1.023769  1.125469
2013-01-03 -0.419120 -1.919785 -0.834839  0.497296
2013-01-02 -0.966575  0.073820  1.850707 -0.067192
2013-01-05 -1.051489  0.857625  0.791734 -0.864913
2013-01-04 -1.599862  2.503262  0.729267  0.909971

In [129]:
print(df.sum())          # row 들의 합 (col : 합) axis=0 디폴트
print(df.sum(axis=1))    # column 들의 함 (row : 합) axis=1

A   -3.571463
B    1.697027
C    3.777136
D    1.905065
dtype: float64
2013-01-01    1.727681
2013-01-02    0.890760
2013-01-03   -2.676448
2013-01-04    2.542637
2013-01-05   -0.267043
2013-01-06    1.590177
Freq: D, dtype: float64

### 6. Merging

```
concat
join
merge
```

### 7. Grouping

```
Splitting the data into groups based on some criteria
Applying a function to each group independently
Combining the results into a data structure

```

In [130]:
df_g = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

df_g

     A      B         C         D
0  foo    one -0.135403  1.466320
1  bar    one  1.041721 -0.426356
2  foo    two -1.058521  0.307807
3  bar  three  0.350203  0.071552
4  foo    two -1.507742 -1.287191
5  bar    two -1.220942 -0.497981
6  foo    one -0.129807  1.361807
7  foo  three -0.043958 -1.271253

df.groupby().size()

In [131]:
df_g.groupby(['A','B']).size()

A    B
bar  one      1
     three    1
     two      1
foo  one      2
     three    1
     two      2
dtype: int64

[].reset_index / [[]].reset_index

In [132]:
df_g.groupby(['A','B'])['C'].value_counts()

# df_g.groupby(['A','B'])['C'].value_counts().reset_index() 는 오류발생. ('C' 가 중복된다. )
# new_df_g = df_g.groupby(['A','B'])['C'].value_counts()
# new_df_g.name = C_count
# new_df_g.reset_index()

A    B      C
bar  one     1.041721    1
     three   0.350203    1
     two    -1.220942    1
foo  one    -0.135403    1
            -0.129807    1
     three  -0.043958    1
     two    -1.507742    1
            -1.058521    1
Name: count, dtype: int64

In [133]:
# [[C]] 은 데이터 프레임이라서 reset_index 가 가능하다. 

df_g.groupby(['A','B'])[['C']].sum().reset_index()

     A      B         C
0  bar    one  1.041721
1  bar  three  0.350203
2  bar    two -1.220942
3  foo    one -0.265210
4  foo  three -0.043958
5  foo    two -2.566263

### 8. Reshaping

```
reshpae(-1)
stack / unstack 
pivot table
```

In [134]:
df_g.set_index(['A','B'])[['C']]#.unstack()

# Index contains duplicate entries, cannot reshape : 'foo one' 이 중복된다. 
# df.drop_duplicates(subset=['index','column']) 으로 해결

                  C
A   B
foo one   -0.135403
bar one    1.041721
foo two   -1.058521
bar three  0.350203
foo two   -1.507742
bar two   -1.220942
foo one   -0.129807
    three -0.043958

drop_duplicates

subset : 중복을 검사할 column 
keep: 중복값중 남길 행

df.drop ()
axis = 0/1 (행/열)     조건이 있는 경우 slicing 을 이용하자

In [135]:
# df_g2 = df_g.drop([6,2]).reset_index(drop=True) 
# A,B 열 값이 중복되는 2, 6 row을 삭제

df_g2 = df_g.drop_duplicates(subset=['A','B'],keep='first', ignore_index=True).copy()  # inplace = True 으로 원본 적용

df_g2

     A      B         C         D
0  foo    one -0.135403  1.466320
1  bar    one  1.041721 -0.426356
2  foo    two -1.058521  0.307807
3  bar  three  0.350203  0.071552
4  bar    two -1.220942 -0.497981
5  foo  three -0.043958 -1.271253

In [136]:
df_g2.set_index(['A','B'])[['C']].unstack()

            C
B         one     three       two
A
bar  1.041721  0.350203 -1.220942
foo -0.135403 -0.043958 -1.058521

In [137]:
df_g2.pivot(index='A',columns='B',values='C')

B         one     three       two
A
bar  1.041721  0.350203 -1.220942
foo -0.135403 -0.043958 -1.058521

pivot_table()

In [138]:
df_g2.pivot_table(index ='A',columns='B',values='C')

# pd.pivot_table(df_g2, index ='A',columns='B',values='C')

B         one     three       two
A
bar  1.041721  0.350203 -1.220942
foo -0.135403 -0.043958 -1.058521

### 9. Time Series

In [139]:
rng = pd.date_range("1/1/2012", periods=100, freq="S")

ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts.resample("5Min").sum()

2012-01-01    23845
Freq: 5T, dtype: int64

In [140]:
ts

2012-01-01 00:00:00    248
2012-01-01 00:00:01    141
2012-01-01 00:00:02    158
2012-01-01 00:00:03    392
2012-01-01 00:00:04    484
                      ...
2012-01-01 00:01:35    327
2012-01-01 00:01:36     84
2012-01-01 00:01:37     91
2012-01-01 00:01:38    313
2012-01-01 00:01:39    203
Freq: S, Length: 100, dtype: int64

### 10. Categroicals

### 11. Plotting